jhgorse/STM32F429ZITx_cube_usbh_hid/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
    // Something totally different, executes, but fails to perform intended function
    if (USBH_HID_SetReport (phost, // H2D, CLASS REQ
         0x02, // Type 1 in, 2 out, 3 feature, ff res
         1,    // Id
         _buf,
         sizeof(_buf)) == USBH_OK)
    {
      HID_Handle->state = HID_SYNC;
    }

//    HID_Handle->timer = phost->Timer;
//    HID_Handle->DataReady = 0;
    break;

  case HID_POLL_SEND:

    urb_state = USBH_LL_GetURBState(phost, HID_Handle->OutPipe);

    if(urb_state == USBH_URB_DONE)
    {
      HID_Handle->state = HID_SYNC;
    }
    else if(urb_state == USBH_URB_STALL) /* IN Endpoint Stalled */
    {
      printf("HID_POLL_SEND stalled\n");
      /* Issue Clear Feature on interrupt IN endpoint */
      if(USBH_ClrFeature(phost,
                         HID_Handle->ep_addr) == USBH_OK)
      {
        /* Change state to issue next OUT token */
        HID_Handle->state = HID_IDLE;
      }
    }
    break;

  case HID_SYNC:
    if(phost->Timer & 1)     /* Sync with start of Even Frame */
    {
      HID_Handle->state = HID_GET_DATA;
    }
    break;

  case HID_GET_DATA:
    // *,1 fail
    // *,2-3 pData=0x8 0x1B
    //
    if(USBH_HID_GetReport (phost, // 10100001 - D2H, CLASS REQ
                           0x02, // Type 1 in, 2 out, 3 feature, ff res
                           0x0,   // Id
                            HID_Handle->pData,
                            HID_Handle->length) == USBH_OK)
    {
      printf("USBH_HID_GetReport(phost, type=0x1, Id=0, len=0x%x, HID_Handle->pData=0x%x 0x%x)\n",
          HID_Handle->length,HID_Handle->pData[0],HID_Handle->pData[1]);

      fifo_write(&HID_Handle->fifo, HID_Handle->pData, HID_Handle->length);
      HID_Handle->state = HID_IDLE;
    }

//    // Interrupt Read, never works
//    USBH_InterruptReceiveData(phost,
//        HID_Handle->pData,
//        HID_Handle->length,
//        HID_Handle->InPipe);
//    HID_Handle->state = HID_POLL_GET;
//
//    // Direct read fifo, does nothing
//    dest = USB_ReadPacket(USB_OTG_HS,
//        HID_Handle->pData,      // dest buffer
//        HID_Handle->length);    // Length
//
//    if (dest != NULL) {
//
//      fifo_write(&HID_Handle->fifo, HID_Handle->pData, HID_Handle->length);
//      HID_Handle->DataReady = 1;
//      USBH_HID_EventCallback(phost);
//
//      HID_Handle->timer = phost->Timer;
//      HID_Handle->DataReady = 0;
//      HID_Handle->state = HID_IDLE;
//    }
    
    break;
    
  case HID_POLL_GET: // We should have data after this..
    
    urb_state = USBH_LL_GetURBState(phost, HID_Handle->InPipe);

    if(urb_state == USBH_URB_DONE)
    {
      if(HID_Handle->DataReady == 0)
      {
        fifo_write(&HID_Handle->fifo, HID_Handle->pData, HID_Handle->length);
        HID_Handle->DataReady = 1;
        USBH_HID_EventCallback(phost);
      }
      HID_Handle->state = HID_IDLE;
    }
    else if(urb_state == USBH_URB_STALL) /* IN Endpoint Stalled */
    {
      printf("HID_POLL_GET stalled");
      /* Issue Clear Feature on interrupt IN endpoint */ 
      if(USBH_ClrFeature(phost,
                         HID_Handle->ep_addr) == USBH_OK)
      {
        /* Change state to issue next IN token */
        HID_Handle->state = HID_IDLE;
      }
    } 
    else if (hhcd->hc[HID_Handle->InPipe].state == HC_NAK)
    {
//      printf("GET NAK, try again\n");
//      HID_Handle->state = HID_IDLE;
    }
    break;
    
  default:
    break;
  }
  return status;
}

/**
  * @brief  USBH_HID_SOFProcess 
  *         The function is for managing the SOF Process 
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost)
{
  HID_HandleTypeDef *HID_Handle =  (HID_HandleTypeDef *) phost->pActiveClass->pData;
  
  if(
//      HID_Handle->state == HID_POLL_GET
//      || HID_Handle->state == HID_POLL_SEND
      HID_Handle->state == HID_IDLE
      )
  {
    if(( phost->Timer - HID_Handle->timer) >= HID_Handle->poll+90)
    {
      HID_Handle->state = HID_GET_DATA;
    }
  }
  return USBH_OK;
}

/**
* @brief  USBH_Get_HID_ReportDescriptor
  *         Issue report Descriptor command to the device. Once the response 
  *         received, parse the report descriptor and update the status.
  * @param  phost: Host handle
  * @param  Length : HID Report Descriptor Length
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_HID_GetHIDReportDescriptor (USBH_HandleTypeDef *phost,
                                                         uint16_t length)
{
  
  USBH_StatusTypeDef status;
  
  status = USBH_GetDescriptor(phost,
                              USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,                                  
                              USB_DESC_HID_REPORT, 
                              phost->device.Data,
                              length);
  
  /* HID report descriptor is available in phost->device.Data.
  In case of USB Boot Mode devices for In report handling ,
  HID report descriptor parsing is not required.
  In case, for supporting Non-Boot Protocol devices and output reports,
  user may parse the report descriptor*/
  // TODO: Parse report descriptors here
  
  return status;
}

/**
  * @brief  USBH_Get_HID_Descriptor
  *         Issue HID Descriptor command to the device. Once the response 
  *         received, parse the report descriptor and update the status.
  * @param  phost: Host handle
  * @param  Length : HID Descriptor Length
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_HID_GetHIDDescriptor (USBH_HandleTypeDef *phost,
                                            uint16_t length)
{
  
  USBH_StatusTypeDef status;
  
  status = USBH_GetDescriptor( phost,
                              USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,                                  
                              USB_DESC_HID,
                              phost->device.Data,
                              length);
 
  return status;
}

/**
  * @brief  USBH_Set_Idle
  *         Set Idle State. 
  * @param  phost: Host handle
  * @param  duration: Duration for HID Idle request
  * @param  reportId : Targeted report ID for Set Idle request
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_HID_SetIdle (USBH_HandleTypeDef *phost,
                                         uint8_t duration,
                                         uint8_t reportId)
{
  
  phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE |\
    USB_REQ_TYPE_CLASS;
  
  
  phost->Control.setup.b.bRequest = USB_HID_SET_IDLE;
  phost->Control.setup.b.wValue.w = (duration << 8 ) | reportId;
  
  phost->Control.setup.b.wIndex.w = 0;
  phost->Control.setup.b.wLength.w = 0;
  
  return USBH_CtlReq(phost, 0 , 0 );
}


/**
  * @brief  USBH_HID_Set_Report
  *         Issues Set Report 
  * @param  phost: Host handle
  * @param  reportType  : Report type to be sent
  * @param  reportId    : Targeted report ID for Set Report request
  * @param  reportBuff  : Report Buffer
  * @param  reportLen   : Length of data report to be send
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_HID_SetReport (USBH_HandleTypeDef *phost,
                                    uint8_t reportType,
                                    uint8_t reportId,
                                    uint8_t* reportBuff,
                                    uint8_t reportLen)
{
  
  phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE |\
    USB_REQ_TYPE_CLASS;
  
  
